---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.BaseSchema
source: html/825dc7e3-e338-ba8b-4161-f7c36b5c3be6.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.BaseSchema Property

The property labeled "BaseSchema" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string BaseSchema { get; }
```

## Remarks
This property is of type "AssetPropertyString".